## Pandas

In [2]:
import pandas as pd
import numpy as np

## GroupBY

In [11]:
df= pd.DataFrame({'clave' : ['eva0', 'eva1', 'eva1', 'eva3', 'eva0'],
                  'clave1' : ['a', 'a', 'b', 'b', 'a'],
                  'clave2' : ['uno', 'dos', 'uno', 'dos', 'uno'],
                  'data1' : np.random.randn(5),
                  'data2' : np.random.randn(5)})

In [12]:
df

  clave clave1 clave2     data1     data2
0  eva0      a    uno -0.301370  0.134360
1  eva1      a    dos  0.466192 -0.027443
2  eva1      b    uno  0.630362  1.073648
3  eva3      b    dos -1.004493 -1.926470
4  eva0      a    uno -0.548763 -1.190999

In [13]:
df.groupby(["clave"]).size()

clave
eva0    2
eva1    2
eva3    1
dtype: int64

In [14]:
df.groupby(["clave","clave1"]).mean()

                 data1     data2
clave clave1
eva0  a      -0.425067 -0.528320
eva1  a       0.466192 -0.027443
      b       0.630362  1.073648
eva3  b      -1.004493 -1.926470

In [15]:
df.groupby(["clave","clave1"])['data1'].sum()

clave  clave1
eva0   a        -0.850134
eva1   a         0.466192
       b         0.630362
eva3   b        -1.004493
Name: data1, dtype: float64

In [16]:
grupo = df['data1'].groupby(df['clave'])

In [17]:
type(grupo)

pandas.core.groupby.generic.SeriesGroupBy

In [18]:
df.groupby(['clave','clave1']).mean()

                 data1     data2
clave clave1
eva0  a      -0.425067 -0.528320
eva1  a       0.466192 -0.027443
      b       0.630362  1.073648
eva3  b      -1.004493 -1.926470

# Join

---

In [19]:
uno = pd.DataFrame({'clave1': ['uls', 'uls', 'ucn'],
                     'clave2': ['uno', 'dos', 'uno'],
                   'Uvalores':np.arange(10,25,5)})

In [20]:
uno

  clave1 clave2  Uvalores
0    uls    uno        10
1    uls    dos        15
2    ucn    uno        20

In [21]:
dos = pd.DataFrame({'clave1': ['uls', 'uls', 'test', 'ucn'],
                       'clave2': ['uno', 'uno', 'uno', 'dos'],
                      'Dvalores': [4, 5, 6, 7]})

In [22]:
dos

  clave1 clave2  Dvalores
0    uls    uno         4
1    uls    uno         5
2   test    uno         6
3    ucn    dos         7

### OUTER

In [23]:
test = pd.merge(uno, dos, on='clave1',how='outer')
test

  clave1 clave2_x  Uvalores clave2_y  Dvalores
0    uls      uno      10.0      uno         4
1    uls      uno      10.0      uno         5
2    uls      dos      15.0      uno         4
3    uls      dos      15.0      uno         5
4    ucn      uno      20.0      dos         7
5   test      NaN       NaN      uno         6

### INNER

In [24]:
pd.merge(uno, dos,on='clave1', how='inner')

  clave1 clave2_x  Uvalores clave2_y  Dvalores
0    uls      uno        10      uno         4
1    uls      uno        10      uno         5
2    uls      dos        15      uno         4
3    uls      dos        15      uno         5
4    ucn      uno        20      dos         7

### COLUMNAS CALCULADAS

In [25]:
df = pd.DataFrame({'A':[1,1,2,2],'B':[1,2,1,2],'valores':np.arange(10,30,5)})
df

   A  B  valores
0  1  1       10
1  1  2       15
2  2  1       20
3  2  2       25

In [26]:
df.groupby(["B"]).sum()

   A  valores
B
1  3       30
2  3       40

In [27]:
df['suma_valores_A'] = df.groupby('A')['valores'].transform(np.sum)
df

   A  B  valores  suma_valores_A
0  1  1       10              25
1  1  2       15              25
2  2  1       20              45
3  2  2       25              45